In [1]:
# Create pandas
! pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/envs/nr/lib/python3.11/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.23.2 in /opt/anaconda3/envs/nr/lib/python3.11/site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/envs/nr/lib/python3.11/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/envs/nr/lib/python3.11/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/envs/nr/lib/python3.11/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/envs/nr/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [7]:
import pandas as pd
data =[10,11,12,13,14]
series = pd.Series(data)
print(series)
print(type(series))

0    10
1    11
2    12
3    13
4    14
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
# Create a series from dictionary
data = { 'a':1 , 'b': 2 , 'c': 3, 'd':4}
dic_series = pd.Series(data)
print(dic_series)

# index : a,b,c ,d 
# values : 1,2,3,4

a    1
b    2
c    3
d    4
dtype: int64

In [5]:

import pandas as pd
data = [1,2,3,4]
index1 = ['a','b','c','d']
series = pd.Series(data,index=index1)
print(series)

a    1
b    2
c    3
d    4
dtype: int64

In [7]:

import pandas as pd
data = [1,2,3,4,6,7]
index = ['a','b','c','d','a','d']
series = pd.Series(data,index=index)
print(series)

a    1
b    2
c    3
d    4
a    6
d    7
dtype: int64

In [13]:
# DataFrame
# Create a dataframe from a dictionary of list
data={
    'Name': ['Tom' , 'Jarry' , 'John'],
    'age': [20,22,66],
    'city' : ["Chicago","NewYork", "Austin"]

}

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  age     city
0    Tom   20  Chicago
1  Jarry   22  NewYork
2   John   66   Austin
<class 'pandas.core.frame.DataFrame'>

In [26]:
# Convert it in arry

import numpy as np
np.array(df)

array([['Tom', 20, 'Chicago'],
       ['Jarry', 22, 'NewYork'],
       ['John', 66, 'Austin']], dtype=object)

In [27]:
# Create a dataframe from list of Dic 
data=[
{'name':'Tommy', 'age' : 10 , 'city': 'Chicago'} ,
{'name':'Linda', 'age' : 20 , 'city': 'New York'}
]

df= pd.DataFrame(data)
print(df)

    name  age      city
0  Tommy   10   Chicago
1  Linda   20  New York

In [11]:
import pandas as pd
df= pd.read_csv('sales_data.csv')
df.head(5)

,Date,Day,Month,Year,Customer_Age,Age_Group,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
0,2013-11-26,26,November,2013,19,Youth (<25),M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8,45,120,590,360,950
1,2015-11-26,26,November,2015,19,Youth (<25),M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8,45,120,590,360,950
2,2014-03-23,23,March,2014,49,Adults (35-64),M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,23,45,120,1366,1035,2401
3,2016-03-23,23,March,2016,49,Adults (35-64),M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,20,45,120,1188,900,2088
4,2014-05-15,15,May,2014,47,Adults (35-64),F,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,4,45,120,238,180,418

In [12]:
df.tail(5)

,Date,Day,Month,Year,Customer_Age,Age_Group,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
113031,2016-04-12,12,April,2016,41,Adults (35-64),M,United Kingdom,England,Clothing,Vests,"Classic Vest, S",3,24,64,112,72,184
113032,2014-04-02,2,April,2014,18,Youth (<25),M,Australia,Queensland,Clothing,Vests,"Classic Vest, M",22,24,64,655,528,1183
113033,2016-04-02,2,April,2016,18,Youth (<25),M,Australia,Queensland,Clothing,Vests,"Classic Vest, M",22,24,64,655,528,1183
113034,2014-03-04,4,March,2014,37,Adults (35-64),F,France,Seine (Paris),Clothing,Vests,"Classic Vest, L",24,24,64,684,576,1260
113035,2016-03-04,4,March,2016,37,Adults (35-64),F,France,Seine (Paris),Clothing,Vests,"Classic Vest, L",23,24,64,655,552,1207

In [16]:
# Accessing data from DataFrame
data=[
{'name':'Tommy', 'age' : 10 , 'city': 'Chicago'} ,
{'name':'Linda', 'age' : 20 , 'city': 'New York'},
{'name':'John', 'age' : 30 , 'city': 'Los Angeles'},
{'name':'Peter', 'age' : 40 , 'city': 'Houston'},

]

df= pd.DataFrame(data)
print(df)

    name  age         city
0  Tommy   10      Chicago
1  Linda   20     New York
2   John   30  Los Angeles
3  Peter   40      Houston

In [32]:
data=[
{'name':'Tommy', 'age' : 10 , 'city': 'Chicago'} ,
{'name':'Linda', 'age' : 20 , 'city': 'New York'},
{'name':'John', 'age' : 30 , 'city': 'Los Angeles'},
{'name':'Peter', 'age' : 40 , 'city': 'Houston'},

]

df= pd.DataFrame(data)
print(df)

    name  age         city
0  Tommy   10      Chicago
1  Linda   20     New York
2   John   30  Los Angeles
3  Peter   40      Houston

In [33]:
print("\nprint 0th row.")
df.loc[0]

print 0th row.

name      Tommy
age          10
city    Chicago
Name: 0, dtype: object

In [34]:
print("\nPrint Names: ")
df['name']

Print Names:

0    Tommy
1    Linda
2     John
3    Peter
Name: name, dtype: object

In [35]:
df.loc[0][0]

/var/folders/4g/79c6w1k97_39sb6ktdkx1fh40000gn/T/ipykernel_3851/2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Tommy'

In [41]:
df.iloc[0][0]

/var/folders/4g/79c6w1k97_39sb6ktdkx1fh40000gn/T/ipykernel_3851/2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Tommy'

In [39]:
df.iloc[0][2]

/var/folders/4g/79c6w1k97_39sb6ktdkx1fh40000gn/T/ipykernel_3851/2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Chicago'

In [42]:
df.iloc[:, 1]

0    10
1    20
2    30
3    40
Name: age, dtype: int64

In [43]:
# Accesing a specified element 
df['name']

0    Tommy
1    Linda
2     John
3    Peter
Name: name, dtype: object

In [44]:
df

    name  age         city
0  Tommy   10      Chicago
1  Linda   20     New York
2   John   30  Los Angeles
3  Peter   40      Houston

In [46]:
df.at[1,'city']

'New York'

In [50]:
df.at[1,'age']

np.int64(20)

In [55]:
df1= df.at[0,'age']
print(df1)

df2= df.at[1,'age']
print(df2)

10
20

In [57]:
df.iat[2,2]

'Los Angeles'

In [74]:
import pandas as pd

data = {
    'name': ['Tommy', 'Linda', 'John', 'Peter'],
    'age': [10, 20, 30, 40],
    'city': ['Chicago', 'New York', 'Los Angeles', 'Houston']
}

df = pd.DataFrame(data)

print(df)

    name  age         city
0  Tommy   10      Chicago
1  Linda   20     New York
2   John   30  Los Angeles
3  Peter   40      Houston

In [75]:
# Add a column
df['salary'] =[10000,50000,60000,70000]
print(df)

    name  age         city  salary
0  Tommy   10      Chicago   10000
1  Linda   20     New York   50000
2   John   30  Los Angeles   60000
3  Peter   40      Houston   70000

In [76]:
# remove a column
# inplace = true means drop will be parmanent 
df.drop('salary', axis=1, inplace=True)

In [78]:
print(df)

    name  age         city
0  Tommy   10      Chicago
1  Linda   20     New York
2   John   30  Los Angeles
3  Peter   40      Houston

In [80]:
# add age 
df['age'] = df['age'] +1

In [82]:
print(df)

    name  age         city
0  Tommy   11      Chicago
1  Linda   21     New York
2   John   31  Los Angeles
3  Peter   41      Houston

In [83]:
# drop first row.
df.drop(0,inplace=True)

In [84]:
print(df)

    name  age         city
1  Linda   21     New York
2   John   31  Los Angeles
3  Peter   41      Houston

In [90]:
import pandas as pd
df= pd.read_csv('sales_data.csv')
df.head(5)

,Date,Day,Month,Year,Customer_Age,Age_Group,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
0,2013-11-26,26,November,2013,19,Youth (<25),M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8,45,120,590,360,950
1,2015-11-26,26,November,2015,19,Youth (<25),M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8,45,120,590,360,950
2,2014-03-23,23,March,2014,49,Adults (35-64),M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,23,45,120,1366,1035,2401
3,2016-03-23,23,March,2016,49,Adults (35-64),M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,20,45,120,1188,900,2088
4,2014-05-15,15,May,2014,47,Adults (35-64),F,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,4,45,120,238,180,418

In [92]:
# Display the datatype of each column
print("data type ", df.dtypes)
print()

data type  Date                object
Day                  int64
Month               object
Year                 int64
Customer_Age         int64
Age_Group           object
Customer_Gender     object
Country             object
State               object
Product_Category    object
Sub_Category        object
Product             object
Order_Quantity       int64
Unit_Cost            int64
Unit_Price           int64
Profit               int64
Cost                 int64
Revenue              int64
dtype: object

In [94]:
# Describe the dataframe:
print("Statastical Summary: ",df.describe())

Statastical Summary:                   Day           Year   Customer_Age  Order_Quantity  \
count  113036.000000  113036.000000  113036.000000   113036.000000
mean       15.665753    2014.401739      35.919212       11.901660
std         8.781567       1.272510      11.021936        9.561857
min         1.000000    2011.000000      17.000000        1.000000
25%         8.000000    2013.000000      28.000000        2.000000
50%        16.000000    2014.000000      35.000000       10.000000
75%        23.000000    2016.000000      43.000000       20.000000
max        31.000000    2016.000000      87.000000       32.000000

           Unit_Cost     Unit_Price         Profit           Cost  \
count  113036.000000  113036.000000  113036.000000  113036.000000
mean      267.296366     452.938427     285.051665     469.318695
std       549.835483     922.071219     453.887443     884.866118
min         1.000000       2.000000     -30.000000       1.000000
25%         2.000000       5.000000      29.000000      28.000000
50%         9.000000      24.000000     101.000000     108.000000
75%        42.000000      70.000000     358.000000     432.000000
max      2171.000000    3578.000000   15096.000000   42978.000000

             Revenue
count  113036.000000
mean      754.370360
std      1309.094674
min         2.000000
25%        63.000000
50%       223.000000
75%       800.000000
max     58074.000000

In [95]:
# Group by a column perform an aggregation :
mean = df.groupby('Product_Category')['Profit'].mean()
print(mean)

Product_Category
Accessories    126.388719
Bikes          789.749673
Clothing       167.677276
Name: Profit, dtype: float64